{"keras_version": "1.2.1", "config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\ttest-4.py\u00da\b<lambda>A\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "input_dtype": "float32", "output_shape": null, "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "batch_input_shape": [null, 160, 320, 3], "trainable": true}, "class_name": "Lambda"}, {"config": {"input_dtype": "float32", "cropping": [[70, 25], [0, 0]], "trainable": true, "batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_1"}, "class_name": "Cropping2D"}, {"config": {"activity_regularizer": null, "nb_filter": 16, "bias": true, "border_mode": "same", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_row": 8, "name": "convolution2d_1", "nb_col": 8, "subsample": [4, 4], "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_filter": 32, "bias": true, "border_mode": "same", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_2", "nb_col": 5, "subsample": [2, 2], "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_filter": 64, "bias": true, "border_mode": "same", "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "name": "convolution2d_3", "nb_col": 5, "subsample": [2, 2], "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 512, "input_dim": 6400, "activation": "linear", "W_regularizer": null, "b_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"W_constraint": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "input_dim": 512, "activation": "linear", "W_regularizer": null, "b_constraint": null, "name": "dense_2"}, "class_name": "Dense"}], "class_name": "Sequential"}