____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to                     
====================================================================================================
lambda_1 (Lambda)                (None, 160, 320, 3)   0           lambda_input_1[0][0]             
____________________________________________________________________________________________________
cropping2d_1 (Cropping2D)        (None, 65, 320, 3)    0           lambda_1[0][0]                   
____________________________________________________________________________________________________
convolution2d_1 (Convolution2D)  (None, 17, 80, 16)    3088        cropping2d_1[0][0]               
____________________________________________________________________________________________________
elu_1 (ELU)                      (None, 17, 80, 16)    0           convolution2d_1[0][0]            
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 9, 40, 32)     12832       elu_1[0][0]                      
____________________________________________________________________________________________________
elu_2 (ELU)                      (None, 9, 40, 32)     0           convolution2d_2[0][0]            
____________________________________________________________________________________________________
convolution2d_3 (Convolution2D)  (None, 5, 20, 64)     51264       elu_2[0][0]                      
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 6400)          0           convolution2d_3[0][0]            
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 6400)          0           flatten_1[0][0]                  
____________________________________________________________________________________________________
elu_3 (ELU)                      (None, 6400)          0           dropout_1[0][0]                  
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 512)           3277312     elu_3[0][0]                      
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 512)           0           dense_1[0][0]                    
____________________________________________________________________________________________________
elu_4 (ELU)                      (None, 512)           0           dropout_2[0][0]                  
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 1)             513         elu_4[0][0]                      
====================================================================================================
Total params: 3,345,009
Trainable params: 3,345,009
Non-trainable params: 0


6830/6830 [==============================] - 23s - loss: 0.1317 - val_loss: 0.0467
Epoch 2/10
6830/6830 [==============================] - 18s - loss: 0.0432 - val_loss: 0.0351
Epoch 3/10
6830/6830 [==============================] - 16s - loss: 0.0365 - val_loss: 0.0308
Epoch 4/10
6830/6830 [==============================] - 16s - loss: 0.0332 - val_loss: 0.0294
Epoch 5/10
6830/6830 [==============================] - 15s - loss: 0.0304 - val_loss: 0.0286
Epoch 6/10
6830/6830 [==============================] - 15s - loss: 0.0287 - val_loss: 0.0286
Epoch 7/10
6830/6830 [==============================] - 15s - loss: 0.0276 - val_loss: 0.0294
Epoch 8/10
6830/6830 [==============================] - 15s - loss: 0.0265 - val_loss: 0.0249
Epoch 9/10
6830/6830 [==============================] - 14s - loss: 0.0253 - val_loss: 0.0260
Epoch 10/10
6830/6830 [==============================] - 15s - loss: 0.0252 - val_loss: 0.0290

