{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>@\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "input_dtype": "float32", "function_type": "lambda"}}, {"class_name": "Cropping2D", "config": {"trainable": true, "name": "cropping2d_1", "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "cropping": [[70, 25], [0, 0]]}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "nb_row": 8, "name": "convolution2d_1", "activation": "linear", "b_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf", "subsample": [4, 4], "W_constraint": null, "nb_filter": 16, "border_mode": "same", "nb_col": 8}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "name": "convolution2d_2", "activation": "linear", "b_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "nb_filter": 32, "border_mode": "same", "nb_col": 5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "nb_row": 5, "name": "convolution2d_3", "activation": "linear", "b_constraint": null, "bias": true, "trainable": true, "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "nb_filter": 64, "border_mode": "same", "nb_col": 5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 512, "input_dim": 6400, "name": "dense_1", "activation": "linear", "b_constraint": null, "bias": true, "trainable": true, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1, "input_dim": 512, "name": "dense_2", "activation": "linear", "b_constraint": null, "bias": true, "trainable": true, "W_constraint": null, "b_regularizer": null}}], "keras_version": "1.2.1"}